【回顾&引言】前面一章的内容大家可以感觉到我们主要是对基础知识做一个梳理，让大家了解数据分析的一些操作，主要做了数据的各个角度的观察。那么在这里，我们主要是做数据分析的流程性学习，主要是包括了数据清洗以及数据的特征处理，数据重构以及数据可视化。这些内容是为数据分析最后的建模和模型评价做一个铺垫。

#### 开始之前，导入numpy、pandas包和数据

In [92]:
#加载所需的库
import numpy as np
import pandas as pd
import math

In [93]:
#加载数据train.csv
train_df = pd.read_csv('train.csv')

In [94]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 2 第二章：数据清洗及特征处理
我们拿到的数据通常是不干净的，所谓的不干净，就是数据中有缺失值，有一些异常点等，需要经过一定的处理才能继续做后面的分析或建模，所以拿到数据的第一步是进行数据清洗，本章我们将学习缺失值、重复值、字符串和数据转换等操作，将数据清洗成可以分析或建模的亚子。

### 2.1 缺失值观察与处理
我们拿到的数据经常会有很多缺失值，比如我们可以看到Cabin列存在NaN，那其他列还有没有缺失值，这些缺失值要怎么处理呢

#### 2.1.1 任务一：缺失值观察
(1) 请查看每个特征缺失值个数  
(2) 请查看Age， Cabin， Embarked列的数据
以上方式都有多种方式，所以大家多多益善

In [95]:
#写入代码
# train_df.info()
#可以看出来age carbin embarked都缺少了数据
sum = train_df.isnull().sum()

sum

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [96]:
#写入代码
sum = train_df.isna().sum()
sum

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [97]:
#写入代码

#### 2.1.2 任务二：对缺失值进行处理
(1)处理缺失值一般有几种思路

(2) 请尝试对Age列的数据的缺失值进行处理

(3) 请尝试使用不同的方法直接对整张表的缺失值进行处理

In [98]:
#处理缺失值的一般思路：
#提醒：可使用的函数有--->dropna函数与fillna函数
#dropna 去除掉missing value   Carbin我其实是想要去除掉  
# fillna 填充掉
age_mean = math.ceil(train_df['Age'].mean())
train_df['Age'].fillna(age_mean)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    30.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [99]:
#写入代码
train_df = train_df.fillna({'Age': math.ceil(train_df.mean()['Age'])})
# df.fillna({'A': df.mean()['A']})

/root/miniconda3/envs/pytorch/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.

In [100]:
train_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [101]:
#写入代码
#对于embarked的填充
train_df['Embarked'].value_counts()

#goal = Series.idxmax()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [102]:
#写入代码 
train_df['Embarked'] = train_df['Embarked'].fillna(train_df['Embarked'].value_counts().idxmax())
#value_counts().idxmax() 这个函数十分的优雅

In [103]:
train_df = train_df.dropna(axis=1)

In [104]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

【思考1】dropna和fillna有哪些参数，分别如何使用呢?

#### dropout
dropna主要有axis，axis = 0表示一行，axis = 1表示 一列，default 是一行。  all 表示得所有的都出现了NaN才删除，默认是any
直接df.dropna(),是把出现NaN的行全部删了。 df.dropna(axis = 1)表示的是把出现NaN指定列删除，但一般不会这么选。
df.dropna(subset=['name', 'toy'])  指定了只看这一部分子集

fillna主要填充作用

In [105]:
# #主要是写一些注意事项了
# train_df = train_df.fillna() #这里注意需要补齐前面的，要赋值
# df.fillna(method="ffill") # bfill 采用下一个有效值来填充 ffill采用上一次的有效值填充

# #标准的对于字符串之类的填充
# train_df['Embarked'] = train_df['Embarked'].fillna(train_df['Embarked'].value_counts().idxmax())
# #对于数值类的最简单的填充  采取均值
# train_df = train_df.fillna({'Age': math.ceil(train_df.mean()['Age'])})

【思考】检索空缺值用`np.nan`,`None`以及`.isnull()`哪个更好，这是为什么？如果其中某个方式无法找到缺失值，原因又是为什么？

#### 思考回答
numpy里边查找NaN值的话，就用np.isnan()。  
pandas里边查找NaN值的话，要么.isna()，要么.isnull()。  
对于float64数字类型的NaN可能无法读出来，这个时候就需要np.nan

In [106]:
'''
import pandas as pd
import numpy as np

df = pd.DataFrame({'tem': ['a', 'b', 'c', ''],
                   'tem1': ['a', np.nan, '', 'd'],
                   'tem2': ['a', 'b', 'c', 'd']})

df['new'] = df['tem'] + df['tem1'] + df['tem2']
print(df)
# 结果如下
  tem tem1 tem2  new
0   a    a    a  aaa
1   b  NaN    b  NaN  # 注意：列new这里直接是NaN
2   c         c   cc
3        d    d   dd 

print(df[df['tem1'].isna()])
# 结果如下
  tem tem1 tem2  new
1   b  NaN    b  NaN    # 注意：结果仅有 NaN的

print(df[df['tem1']==''])
# 结果如下
  tem tem1 tem2 new
2   c         c  cc   # 注意：结果无 NaN的
'''

"\nimport pandas as pd\nimport numpy as np\n\ndf = pd.DataFrame({'tem': ['a', 'b', 'c', ''],\n                   'tem1': ['a', np.nan, '', 'd'],\n                   'tem2': ['a', 'b', 'c', 'd']})\n\ndf['new'] = df['tem'] + df['tem1'] + df['tem2']\nprint(df)\n# 结果如下\n  tem tem1 tem2  new\n0   a    a    a  aaa\n1   b  NaN    b  NaN  # 注意：列new这里直接是NaN\n2   c         c   cc\n3        d    d   dd \n\nprint(df[df['tem1'].isna()])\n# 结果如下\n  tem tem1 tem2  new\n1   b  NaN    b  NaN    # 注意：结果仅有 NaN的\n\nprint(df[df['tem1']==''])\n# 结果如下\n  tem tem1 tem2 new\n2   c         c  cc   # 注意：结果无 NaN的\n"

【参考】https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html

【参考】https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html

### 2.2 重复值观察与处理
由于这样那样的原因，数据中会不会存在重复值呢，如果存在要怎样处理呢

#### 2.2.1 任务一：请查看数据中的重复值

In [107]:
#写入代码
train_df['Age'].duplicated().value_counts()
#没有一个重复值 好多重复值

True     803
False     88
Name: Age, dtype: int64

#### 2.2.2 任务二：对重复值进行处理
(1)重复值有哪些处理方式呢？

(2)处理我们数据的重复值

方法多多益善

In [108]:
#重复值有哪些处理方式：

df = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})

df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [109]:
#写入代码
#法1
df.drop_duplicates()
df.drop_duplicates(subset=['brand']) #选择在这个子集下进行删除，也可以选择多个子集
df.drop_duplicates(subset=['brand', 'style'], keep='last')
#last表示保留最后一项，first表示保存第一项

     brand style  rating
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
4  Indomie  pack     5.0

####  2.2.3 任务三：将前面清洗的数据保存为csv格式

In [110]:
#写入代码
BASE = ''
df.to_csv(BASE+'train_pre.csv') #设置好路径很漂亮

### 2.3 特征观察与处理
我们对特征进行一下观察，可以把特征大概分为两大类：  
数值型特征：Survived ，Pclass， Age ，SibSp， Parch， Fare，其中Survived， Pclass为离散型数值特征，Age，SibSp， Parch， Fare为连续型数值特征  
文本型特征：Name， Sex， Cabin，Embarked， Ticket，其中Sex， Cabin， Embarked， Ticket为类别型文本特征，数值型特征一般可以直接用于模型的训练，但有时候为了模型的稳定性及鲁棒性会对连续变量进行离散化。文本型特征往往需要转换成数值型特征才能用于建模分析。

对于sex这种 只有male和famle的数据，可以通过替换成1和0来进行计算

#### 2.3.1 任务一：对年龄进行分箱（离散化）处理
(1) 分箱操作是什么？

(2) 将连续变量Age平均分箱成5个年龄段，并分别用类别变量12345表示  

(3) 将连续变量Age划分为[0,5) [5,15) [15,30) [30,50) [50,80)五个年龄段，并分别用类别变量12345表示  

(4) 将连续变量Age按10% 30% 50% 70% 90%五个年龄段，并用分类变量12345表示

(5) 将上面的获得的数据分别进行保存，保存为csv格式

#分箱操作是什么：
3.3.1无监督分组：

等宽划分：按照相同宽度将数据分成几等份。缺点是受到异常值的影响比较大。 pandas.cut方法可以进行等宽划分。

等频划分：将数据分成几等份，每等份数据里面的个数是一样的。pandas.qcut方法可以进行等频划分。

In [111]:
import pandas as pd

df = pd.DataFrame([[22,1],[13,1],[33,1],[52,0],[16,0],[42,1],[53,1],[39,1],[26,0],[66,0]],columns=['age','Y'])
#print(df)
df['age_bin_1'] = pd.qcut(df['age'],3) #新增一列存储等频划分的分箱特征
df['age_bin_2'] = pd.cut(df['age'],3)  #新增一列存储等距划分的分箱特征
print(df)

   age  Y       age_bin_1         age_bin_2
0   22  1  (12.999, 26.0]  (12.947, 30.667]
1   13  1  (12.999, 26.0]  (12.947, 30.667]
2   33  1    (26.0, 42.0]  (30.667, 48.333]
3   52  0    (42.0, 66.0]    (48.333, 66.0]
4   16  0  (12.999, 26.0]  (12.947, 30.667]
5   42  1    (26.0, 42.0]  (30.667, 48.333]
6   53  1    (42.0, 66.0]    (48.333, 66.0]
7   39  1    (26.0, 42.0]  (30.667, 48.333]
8   26  0  (12.999, 26.0]  (12.947, 30.667]
9   66  0    (42.0, 66.0]    (48.333, 66.0]

In [112]:
#写入代码
train_df['agerank'] = pd.qcut(train_df['Age'],5,labels = [1,2,3,4,5])
train_df['agerank']  #如果不加label 就是 一段 一段的

0      2
1      4
2      2
3      4
4      4
      ..
886    2
887    1
888    3
889    2
890    4
Name: agerank, Length: 891, dtype: category
Categories (5, int64): [1 < 2 < 3 < 4 < 5]

In [113]:
#写入代码
#设置成分段
train_df['agerank'] = pd.cut(train_df['Age'],[0,5,15,30,50,80],labels = [1,2,3,4,5])
df.head(3)

   age  Y       age_bin_1         age_bin_2
0   22  1  (12.999, 26.0]  (12.947, 30.667]
1   13  1  (12.999, 26.0]  (12.947, 30.667]
2   33  1    (26.0, 42.0]  (30.667, 48.333]

In [114]:
train_df['agerank'] = pd.qcut(train_df['Age'],[0,0.1,0.3,0.5,0.7,0.9],labels = [1,2,3,4,5])

In [115]:
#写入代码
# for dataset in combine:    
#     dataset.loc[ dataset['Age'] <= 16, 'Age'] = 0
#     dataset.loc[(dataset['Age'] > 16) & (dataset['Age'] <= 32), 'Age'] = 1
#     dataset.loc[(dataset['Age'] > 32) & (dataset['Age'] <= 48), 'Age'] = 2
#     dataset.loc[(dataset['Age'] > 48) & (dataset['Age'] <= 64), 'Age'] = 3
#     dataset.loc[ dataset['Age'] > 64, 'Age']
# train_df.head()  #这个是另外一个 不过确实好蠢啊

【参考】https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.cut.html

【参考】https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.qcut.html

#### 2.3.2 任务二：对文本变量进行转换
(1) 查看文本变量名及种类  
(2) 将文本变量Sex， Cabin ，Embarked用数值变量12345表示  
(3) 将文本变量Sex， Cabin， Embarked用one-hot编码表示

In [116]:
#写入代码

train_df['Sex'] = train_df['Sex'].map({'female':1,'male':0}).astype(int)

In [117]:
train_df['Embarked'].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [118]:
train_df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,agerank
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,S,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C,5
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,S,3
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,S,5
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,S,5
5,6,0,3,"Moran, Mr. James",0,30.0,0,0,330877,8.4583,Q,3
6,7,0,1,"McCarthy, Mr. Timothy J",0,54.0,0,0,17463,51.8625,S,NaN
7,8,0,3,"Palsson, Master. Gosta Leonard",0,2.0,3,1,349909,21.0750,S,1
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",1,27.0,0,2,347742,11.1333,S,3
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",1,14.0,1,0,237736,30.0708,C,1

In [119]:
train_df['Embarked']=train_df['Embarked'].map( {'S': 0, 'C': 1, 'Q': 2} ).astype(int)

In [120]:
#写入代码
train_df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,agerank
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,1,5
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,0,3
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,0,5
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,0,5
5,6,0,3,"Moran, Mr. James",0,30.0,0,0,330877,8.4583,2,3
6,7,0,1,"McCarthy, Mr. Timothy J",0,54.0,0,0,17463,51.8625,0,NaN
7,8,0,3,"Palsson, Master. Gosta Leonard",0,2.0,3,1,349909,21.0750,0,1
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",1,27.0,0,2,347742,11.1333,0,3
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",1,14.0,1,0,237736,30.0708,1,1

In [121]:
#写入代码

#### 2.3.3 任务三：从纯文本Name特征里提取出Titles的特征(所谓的Titles就是Mr,Miss,Mrs等)

In [122]:
train_df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [123]:
#写入代码
train_df['Title'] = train_df.Name.str.extract('([A-Za-z]+)\.', expand=False)
#从name里面extract到前面的没有出现 .的值   (+)表示的是所有的，这里可以具体去看网站里面的解说 

train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,agerank,Title
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,0,2,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,1,5,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,0,3,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,0,5,Mrs
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,0,5,Mr

In [124]:
#保存最终你完成的已经清理好的数据
train_df.to_csv('train_pre.csv')